; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v6 - type_3 ?v7 - type_2)
 	      (pred_1 ?v3 - object ?v7 - type_2)
	      (pred_3 ?v6 - type_3 ?v1 - type_1)
	      (pred_4 ?v6 - type_3 ?v3 - object ?v1 - type_1))

   (:action op_3
       :parameters  (?v6 - type_3 ?v8 ?v2 - type_2)
       :precondition (and  (pred_2 ?v6 ?v8))
       :effect (and  (pred_2 ?v6 ?v2)
		     (not (pred_2 ?v6 ?v8))))

   (:action op_1
       :parameters (?v6 - type_3 ?v5 - object ?v4 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v4) (pred_2 ?v6 ?v4) (pred_3 ?v6 ?v1))
       :effect (and (pred_4 ?v6 ?v5 ?v1)
		    (not (pred_1 ?v5 ?v4)) 
		    (not (pred_3 ?v6 ?v1))))

   (:action op_2
       :parameters (?v6 - type_3 ?v5 - object ?v4 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v5 ?v1) (pred_2 ?v6 ?v4))
       :effect (and (pred_1 ?v5 ?v4)
		    (pred_3 ?v6 ?v1)
		    (not (pred_4 ?v6 ?v5 ?v1)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_10 obj_01 - type_3
obj_02 obj_04 obj_11 obj_06 - type_1
obj_07 obj_05 obj_09 - type_2
obj_03 obj_08 - object)
(:init
(pred_2 obj_10 obj_05)
(pred_3 obj_10 obj_02)
(pred_3 obj_10 obj_04)
(pred_2 obj_01 obj_05)
(pred_3 obj_01 obj_11)
(pred_3 obj_01 obj_06)
(pred_1 obj_03 obj_07)
(pred_1 obj_08 obj_09)
)
(:goal
(and
(pred_1 obj_03 obj_05)
(pred_1 obj_08 obj_07)
)
)

(:constraints
  (always (not (pred_2 obj_10 obj_09)))
)
)

; plan
1. (op_3 obj_10 obj_05 obj_07)
   deleted: (pred_2 obj_10 obj_05)
   added: (pred_2 obj_10 obj_07)
   goals met: 0 of 2
2. (op_3 obj_01 obj_05 obj_09)
   deleted: (pred_2 obj_01 obj_05)
   added: (pred_2 obj_01 obj_09)
   goals met: 0 of 2
3. (op_1 obj_01 obj_08 obj_09 obj_06)
   deleted: (pred_1 obj_08 obj_09) (pred_3 obj_01 obj_06)
   added: (pred_4 obj_01 obj_08 obj_06)
   goals met: 0 of 2
4. (op_1 obj_10 obj_03 obj_07 obj_04)
   deleted: (pred_1 obj_03 obj_07) (pred_3 obj_10 obj_04)
   added: (pred_4 obj_10 obj_03 obj_04)
   goals met: 0 of 2
5. (op_3 obj_01 obj_09 obj_07)
   deleted: (pred_2 obj_01 obj_09)
   added: (pred_2 obj_01 obj_07)
   goals met: 0 of 2
6. (op_3 obj_10 obj_07 obj_05)
   deleted: (pred_2 obj_10 obj_07)
   added: (pred_2 obj_10 obj_05)
   goals met: 0 of 2
7. (op_2 obj_10 obj_03 obj_05 obj_04)
   deleted: (pred_4 obj_10 obj_03 obj_04)
   added: (pred_1 obj_03 obj_05) (pred_3 obj_10 obj_04)
   goals met: 1 of 2
8. (op_2 obj_01 obj_08 obj_07 obj_06)
   deleted: (pred_4 obj_01 obj_08 obj_06)
   added: (pred_1 obj_08 obj_07) (pred_3 obj_01 obj_06)
   goals met: 2 of 2
